InformationRegisters/СведенияОДоляхЕП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СведенияОДоляхЕП</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоляОПВ</Name>
					<Comment>Доля ОПВ в сумме единого платежа (в процентах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляВОСМС</Name>
					<Comment>Доля ВОСМС в сумме единого платежа (в процентах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляИПН</Name>
					<Comment>Доля ИПН в сумме единого платежа (в процентах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляСО</Name>
					<Comment>Доля СО в сумме единого платежа (в процентах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляООСМС</Name>
					<Comment>Доля ООСМС в сумме единого платежа (в процентах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляОПВР</Name>
					<Comment>Доля ОПВР в сумме единого платежа (в процентах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияОДоляхЕП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьСведенияОДоляхЕП();
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОДоляхЕП() Экспорт
	                                                   
	НаборЗаписей = РегистрыСведений.СведенияОДоляхЕП.СоздатьНаборЗаписей();
	
	ДобавитьСведенияОДоляхЕП(НаборЗаписей, '20230101', 50, 10, 9, 16, 15, 0);
	ДобавитьСведенияОДоляхЕП(НаборЗаписей, '20240101', 46.5, 9.3, 8.4, 14.9, 14, 7);
	
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		ТекстСообщения = НСтр("ru='Операция не выполнена'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьСведенияОДоляхЕП(НаборЗаписей, Период, ДоляОПВ, ДоляВОСМС, ДоляИПН, ДоляСО, ДоляООСМС, ДоляОПВР)
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.ДоляОПВ = ДоляОПВ;
	НоваяЗапись.ДоляВОСМС = ДоляВОСМС;
	НоваяЗапись.ДоляИПН = ДоляИПН;
	НоваяЗапись.ДоляСО = ДоляСО;
	НоваяЗапись.ДоляООСМС = ДоляООСМС;
	НоваяЗапись.ДоляОПВР = ДоляОПВР;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
